import { FC } from "react";
import { Flex } from "antd";
import StorageTable from "@/components/Storage/StorageTable";

const StoragePage: FC = () => {
  return (
    <Flex justify="center">
      <StorageTable
        data={[
          { name: "Какое-то название", size: "140MB", date: "01.01.2023" },
          { name: "Какое-то название", size: "140MB", date: "01.01.2023" },
          { name: "Какое-то название", size: "140MB", date: "01.01.2023" },
          { name: "Какое-то название", size: "140MB", date: "01.01.2023" },
          { name: "Какое-то название", size: "140MB", date: "01.01.2023" },
          { name: "Какое-то название", size: "140MB", date: "01.01.2023" },
          { name: "Какое-то название", size: "140MB", date: "01.01.2023" },
          { name: "Какое-то название", size: "140MB", date: "01.01.2023" },
          { name: "Какое-то название", size: "140MB", date: "01.01.2023" },
          { name: "Какое-то название", size: "140MB", date: "01.01.2023" },
          { name: "Какое-то название", size: "140MB", date: "01.01.2023" },
          { name: "Какое-то название", size: "140MB", date: "01.01.2023" },
          { name: "Какое-то название", size: "140MB", date: "01.01.2023" },
          { name: "Какое-то название", size: "140MB", date: "01.01.2023" },
          { name: "Какое-то название", size: "140MB", date: "01.01.2023" },
          { name: "Какое-то название", size: "140MB", date: "01.01.2023" },
          { name: "Какое-то название", size: "140MB", date: "01.01.2023" },
          { name: "Какое-то название", size: "140MB", date: "01.01.2023" },
          { name: "Какое-то название", size: "140MB", date: "01.01.2023" },
          { name: "Какое-то название", size: "140MB", date: "01.01.2023" },
          { name: "Какое-то название", size: "140MB", date: "01.01.2023" },
          { name: "Какое-то название", size: "140MB", date: "01.01.2023" },
          { name: "Какое-то название", size: "140MB", date: "01.01.2023" },
          { name: "Какое-то название", size: "140MB", date: "01.01.2023" },
          { name: "Какое-то название", size: "140MB", date: "01.01.2023" },
          { name: "Какое-то название", size: "140MB", date: "01.01.2023" },
          { name: "Какое-то название", size: "140MB", date: "01.01.2023" },
          { name: "Какое-то название", size: "140MB", date: "01.01.2023" },
          { name: "Какое-то название", size: "140MB", date: "01.01.2023" },
          { name: "Какое-то название", size: "140MB", date: "01.01.2023" },
          { name: "Какое-то название", size: "140MB", date: "01.01.2023" },
          { name: "Какое-то название", size: "140MB", date: "01.01.2023" },
          { name: "Какое-то название", size: "140MB", date: "01.01.2023" },
          { name: "Какое-то название", size: "140MB", date: "01.01.2023" },
          { name: "Какое-то название", size: "140MB", date: "01.01.2023" },
          { name: "Какое-то название", size: "140MB", date: "01.01.2023" },
          { name: "Какое-то название", size: "140MB", date: "01.01.2023" },
          { name: "Какое-то название", size: "140MB", date: "01.01.2023" },
          { name: "Какое-то название", size: "140MB", date: "01.01.2023" },
          { name: "Какое-то название", size: "140MB", date: "01.01.2023" },
        ]}
      />
    </Flex>
  );
};

export default StoragePage;
